Revit 2027 API
Element.GetSubelements Method
 Returns the collection of element subelements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Subelement> GetSubelements()
Public Function GetSubelements As IList(Of Subelement)
public:
IList<Subelement^>^ GetSubelements()
member GetSubelements : unit -> IList<Subelement>
Return Value
IList<Subelement>
 The collection of element subelements.
Remarks
 This collection will not include the Element itself.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace